MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32F107RB/mcu.h
/*!< PLL3MUL configuration */
#define RCC_CFGR2_PLL3MUL_Pos                (12U)                             
#define RCC_CFGR2_PLL3MUL_Msk                (0xFUL << RCC_CFGR2_PLL3MUL_Pos)   /*!< 0x0000F000 */
#define RCC_CFGR2_PLL3MUL                    RCC_CFGR2_PLL3MUL_Msk             /*!< PLL3MUL[3:0] bits */
#define RCC_CFGR2_PLL3MUL_0                  (0x1UL << RCC_CFGR2_PLL3MUL_Pos)   /*!< 0x00001000 */
#define RCC_CFGR2_PLL3MUL_1                  (0x2UL << RCC_CFGR2_PLL3MUL_Pos)   /*!< 0x00002000 */
#define RCC_CFGR2_PLL3MUL_2                  (0x4UL << RCC_CFGR2_PLL3MUL_Pos)   /*!< 0x00004000 */
#define RCC_CFGR2_PLL3MUL_3                  (0x8UL << RCC_CFGR2_PLL3MUL_Pos)   /*!< 0x00008000 */

#define RCC_CFGR2_PLL3MUL8_Pos               (13U)                             
#define RCC_CFGR2_PLL3MUL8_Msk               (0x3UL << RCC_CFGR2_PLL3MUL8_Pos)  /*!< 0x00006000 */
#define RCC_CFGR2_PLL3MUL8                   RCC_CFGR2_PLL3MUL8_Msk            /*!< PLL3 input clock * 8 */
#define RCC_CFGR2_PLL3MUL9_Pos               (12U)                             
#define RCC_CFGR2_PLL3MUL9_Msk               (0x7UL << RCC_CFGR2_PLL3MUL9_Pos)  /*!< 0x00007000 */
#define RCC_CFGR2_PLL3MUL9                   RCC_CFGR2_PLL3MUL9_Msk            /*!< PLL3 input clock * 9 */
#define RCC_CFGR2_PLL3MUL10_Pos              (15U)                             
#define RCC_CFGR2_PLL3MUL10_Msk              (0x1UL << RCC_CFGR2_PLL3MUL10_Pos) /*!< 0x00008000 */
#define RCC_CFGR2_PLL3MUL10                  RCC_CFGR2_PLL3MUL10_Msk           /*!< PLL3 input clock * 10 */
#define RCC_CFGR2_PLL3MUL11_Pos              (12U)                             
#define RCC_CFGR2_PLL3MUL11_Msk              (0x9UL << RCC_CFGR2_PLL3MUL11_Pos) /*!< 0x00009000 */
#define RCC_CFGR2_PLL3MUL11                  RCC_CFGR2_PLL3MUL11_Msk           /*!< PLL3 input clock * 11 */
#define RCC_CFGR2_PLL3MUL12_Pos              (13U)                             
#define RCC_CFGR2_PLL3MUL12_Msk              (0x5UL << RCC_CFGR2_PLL3MUL12_Pos) /*!< 0x0000A000 */
#define RCC_CFGR2_PLL3MUL12                  RCC_CFGR2_PLL3MUL12_Msk           /*!< PLL3 input clock * 12 */
#define RCC_CFGR2_PLL3MUL13_Pos              (12U)                             
#define RCC_CFGR2_PLL3MUL13_Msk              (0xBUL << RCC_CFGR2_PLL3MUL13_Pos) /*!< 0x0000B000 */
#define RCC_CFGR2_PLL3MUL13                  RCC_CFGR2_PLL3MUL13_Msk           /*!< PLL3 input clock * 13 */
#define RCC_CFGR2_PLL3MUL14_Pos              (14U)                             
#define RCC_CFGR2_PLL3MUL14_Msk              (0x3UL << RCC_CFGR2_PLL3MUL14_Pos) /*!< 0x0000C000 */
#define RCC_CFGR2_PLL3MUL14                  RCC_CFGR2_PLL3MUL14_Msk           /*!< PLL3 input clock * 14 */
#define RCC_CFGR2_PLL3MUL16_Pos              (13U)                             
#define RCC_CFGR2_PLL3MUL16_Msk              (0x7UL << RCC_CFGR2_PLL3MUL16_Pos) /*!< 0x0000E000 */
#define RCC_CFGR2_PLL3MUL16                  RCC_CFGR2_PLL3MUL16_Msk           /*!< PLL3 input clock * 16 */
#define RCC_CFGR2_PLL3MUL20_Pos              (12U)                             
#define RCC_CFGR2_PLL3MUL20_Msk              (0xFUL << RCC_CFGR2_PLL3MUL20_Pos) /*!< 0x0000F000 */
#define RCC_CFGR2_PLL3MUL20                  RCC_CFGR2_PLL3MUL20_Msk           /*!< PLL3 input clock * 20 */

#define RCC_CFGR2_PREDIV1SRC_Pos             (16U)                             
#define RCC_CFGR2_PREDIV1SRC_Msk             (0x1UL << RCC_CFGR2_PREDIV1SRC_Pos) /*!< 0x00010000 */
#define RCC_CFGR2_PREDIV1SRC                 RCC_CFGR2_PREDIV1SRC_Msk          /*!< PREDIV1 entry clock source */
#define RCC_CFGR2_PREDIV1SRC_PLL2_Pos        (16U)                             
#define RCC_CFGR2_PREDIV1SRC_PLL2_Msk        (0x1UL << RCC_CFGR2_PREDIV1SRC_PLL2_Pos) /*!< 0x00010000 */
#define RCC_CFGR2_PREDIV1SRC_PLL2            RCC_CFGR2_PREDIV1SRC_PLL2_Msk     /*!< PLL2 selected as PREDIV1 entry clock source */
#define RCC_CFGR2_PREDIV1SRC_HSE             0x00000000U                       /*!< HSE selected as PREDIV1 entry clock source */
#define RCC_CFGR2_I2S2SRC_Pos                (17U)                             
#define RCC_CFGR2_I2S2SRC_Msk                (0x1UL << RCC_CFGR2_I2S2SRC_Pos)   /*!< 0x00020000 */
#define RCC_CFGR2_I2S2SRC                    RCC_CFGR2_I2S2SRC_Msk             /*!< I2S2 entry clock source */
#define RCC_CFGR2_I2S3SRC_Pos                (18U)                             
#define RCC_CFGR2_I2S3SRC_Msk                (0x1UL << RCC_CFGR2_I2S3SRC_Pos)   /*!< 0x00040000 */
#define RCC_CFGR2_I2S3SRC                    RCC_CFGR2_I2S3SRC_Msk             /*!< I2S3 clock source */

 
/******************************************************************************/
/*                                                                            */
/*                General Purpose and Alternate Function I/O                  */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for GPIO_CRL register  *******************/
#define GPIO_CRL_MODE_Pos                    (0U)                              
#define GPIO_CRL_MODE_Msk                    (0x33333333UL << GPIO_CRL_MODE_Pos) /*!< 0x33333333 */
#define GPIO_CRL_MODE                        GPIO_CRL_MODE_Msk                 /*!< Port x mode bits */

#define GPIO_CRL_MODE0_Pos                   (0U)                              
#define GPIO_CRL_MODE0_Msk                   (0x3UL << GPIO_CRL_MODE0_Pos)      /*!< 0x00000003 */
#define GPIO_CRL_MODE0                       GPIO_CRL_MODE0_Msk                /*!< MODE0[1:0] bits (Port x mode bits, pin 0) */
#define GPIO_CRL_MODE0_0                     (0x1UL << GPIO_CRL_MODE0_Pos)      /*!< 0x00000001 */
#define GPIO_CRL_MODE0_1                     (0x2UL << GPIO_CRL_MODE0_Pos)      /*!< 0x00000002 */

#define GPIO_CRL_MODE1_Pos                   (4U)                              
#define GPIO_CRL_MODE1_Msk                   (0x3UL << GPIO_CRL_MODE1_Pos)      /*!< 0x00000030 */
#define GPIO_CRL_MODE1                       GPIO_CRL_MODE1_Msk                /*!< MODE1[1:0] bits (Port x mode bits, pin 1) */
#define GPIO_CRL_MODE1_0                     (0x1UL << GPIO_CRL_MODE1_Pos)      /*!< 0x00000010 */
#define GPIO_CRL_MODE1_1                     (0x2UL << GPIO_CRL_MODE1_Pos)      /*!< 0x00000020 */

#define GPIO_CRL_MODE2_Pos                   (8U)                              
#define GPIO_CRL_MODE2_Msk                   (0x3UL << GPIO_CRL_MODE2_Pos)      /*!< 0x00000300 */
#define GPIO_CRL_MODE2                       GPIO_CRL_MODE2_Msk                /*!< MODE2[1:0] bits (Port x mode bits, pin 2) */
#define GPIO_CRL_MODE2_0                     (0x1UL << GPIO_CRL_MODE2_Pos)      /*!< 0x00000100 */
#define GPIO_CRL_MODE2_1                     (0x2UL << GPIO_CRL_MODE2_Pos)      /*!< 0x00000200 */

#define GPIO_CRL_MODE3_Pos                   (12U)                             
#define GPIO_CRL_MODE3_Msk                   (0x3UL << GPIO_CRL_MODE3_Pos)      /*!< 0x00003000 */
#define GPIO_CRL_MODE3                       GPIO_CRL_MODE3_Msk                /*!< MODE3[1:0] bits (Port x mode bits, pin 3) */
#define GPIO_CRL_MODE3_0                     (0x1UL << GPIO_CRL_MODE3_Pos)      /*!< 0x00001000 */
#define GPIO_CRL_MODE3_1                     (0x2UL << GPIO_CRL_MODE3_Pos)      /*!< 0x00002000 */

#define GPIO_CRL_MODE4_Pos                   (16U)                             
#define GPIO_CRL_MODE4_Msk                   (0x3UL << GPIO_CRL_MODE4_Pos)      /*!< 0x00030000 */
#define GPIO_CRL_MODE4                       GPIO_CRL_MODE4_Msk                /*!< MODE4[1:0] bits (Port x mode bits, pin 4) */
#define GPIO_CRL_MODE4_0                     (0x1UL << GPIO_CRL_MODE4_Pos)      /*!< 0x00010000 */
#define GPIO_CRL_MODE4_1                     (0x2UL << GPIO_CRL_MODE4_Pos)      /*!< 0x00020000 */

#define GPIO_CRL_MODE5_Pos                   (20U)                             
#define GPIO_CRL_MODE5_Msk                   (0x3UL << GPIO_CRL_MODE5_Pos)      /*!< 0x00300000 */
#define GPIO_CRL_MODE5                       GPIO_CRL_MODE5_Msk                /*!< MODE5[1:0] bits (Port x mode bits, pin 5) */
#define GPIO_CRL_MODE5_0                     (0x1UL << GPIO_CRL_MODE5_Pos)      /*!< 0x00100000 */
#define GPIO_CRL_MODE5_1                     (0x2UL << GPIO_CRL_MODE5_Pos)      /*!< 0x00200000 */

#define GPIO_CRL_MODE6_Pos                   (24U)                             
#define GPIO_CRL_MODE6_Msk                   (0x3UL << GPIO_CRL_MODE6_Pos)      /*!< 0x03000000 */
#define GPIO_CRL_MODE6                       GPIO_CRL_MODE6_Msk                /*!< MODE6[1:0] bits (Port x mode bits, pin 6) */
#define GPIO_CRL_MODE6_0                     (0x1UL << GPIO_CRL_MODE6_Pos)      /*!< 0x01000000 */
#define GPIO_CRL_MODE6_1                     (0x2UL << GPIO_CRL_MODE6_Pos)      /*!< 0x02000000 */

#define GPIO_CRL_MODE7_Pos                   (28U)                             
#define GPIO_CRL_MODE7_Msk                   (0x3UL << GPIO_CRL_MODE7_Pos)      /*!< 0x30000000 */
#define GPIO_CRL_MODE7                       GPIO_CRL_MODE7_Msk                /*!< MODE7[1:0] bits (Port x mode bits, pin 7) */
#define GPIO_CRL_MODE7_0                     (0x1UL << GPIO_CRL_MODE7_Pos)      /*!< 0x10000000 */
#define GPIO_CRL_MODE7_1                     (0x2UL << GPIO_CRL_MODE7_Pos)      /*!< 0x20000000 */

